garyPenhook/PIC-Assembler/edc/PIC18F55Q24.PIC
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="DMAnDPTRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnDPTRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xEC">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DPTR" edc:mask="0xff" edc:name="DPTR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DPTR8" edc:mask="0x1" edc:name="DPTR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR9" edc:mask="0x1" edc:name="DPTR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR10" edc:mask="0x1" edc:name="DPTR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR11" edc:mask="0x1" edc:name="DPTR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR12" edc:mask="0x1" edc:name="DPTR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR13" edc:mask="0x1" edc:name="DPTR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR14" edc:mask="0x1" edc:name="DPTR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR15" edc:mask="0x1" edc:name="DPTR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="DMAnDSZ" edc:desc="DMA destination size register" edc:name="DMAnDSZ" edc:nzwidth="0x10" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xED">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnDSZL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="DMAnDSZL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xED">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DSZ" edc:mask="0xff" edc:name="DSZ" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="DSZ0" edc:mask="0x1" edc:name="DSZ0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSZ1" edc:mask="0x1" edc:name="DSZ1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSZ2" edc:mask="0x1" edc:name="DSZ2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSZ3" edc:mask="0x1" edc:name="DSZ3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSZ4" edc:mask="0x1" edc:name="DSZ4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSZ5" edc:mask="0x1" edc:name="DSZ5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSZ6" edc:mask="0x1" edc:name="DSZ6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSZ7" edc:mask="0x1" edc:name="DSZ7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="DMAnDSZH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="DMAnDSZH" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xEE">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DSZ" edc:mask="0xf" edc:name="DSZ" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="DSZ8" edc:mask="0x1" edc:name="DSZ8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSZ9" edc:mask="0x1" edc:name="DSZ9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSZ10" edc:mask="0x1" edc:name="DSZ10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSZ11" edc:mask="0x1" edc:name="DSZ11" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="DMAnDSA" edc:desc="DMA destination address register" edc:name="DMAnDSA" edc:nzwidth="0x10" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xEF">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnDSAL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="DMAnDSAL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xEF">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DSA" edc:mask="0xff" edc:name="DSA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DSA0" edc:mask="0x1" edc:name="DSA0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA1" edc:mask="0x1" edc:name="DSA1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA2" edc:mask="0x1" edc:name="DSA2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA3" edc:mask="0x1" edc:name="DSA3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA4" edc:mask="0x1" edc:name="DSA4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA5" edc:mask="0x1" edc:name="DSA5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA6" edc:mask="0x1" edc:name="DSA6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA7" edc:mask="0x1" edc:name="DSA7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
