garyPenhook/PIC-Assembler/edc/PIC18F55Q24.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INT1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="INT1PPS" edc:nzwidth="8" edc:por="--001001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x23F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT1PPS0" edc:mask="0x1" edc:name="INT1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS1" edc:mask="0x1" edc:name="INT1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS2" edc:mask="0x1" edc:name="INT1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS3" edc:mask="0x1" edc:name="INT1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS4" edc:mask="0x1" edc:name="INT1PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS5" edc:mask="0x1" edc:name="INT1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT1PPS" edc:mask="0x3f" edc:name="INT1PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INT2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="INT2PPS" edc:nzwidth="8" edc:por="--001010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x240">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT2PPS0" edc:mask="0x1" edc:name="INT2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS1" edc:mask="0x1" edc:name="INT2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS2" edc:mask="0x1" edc:name="INT2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS3" edc:mask="0x1" edc:name="INT2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS4" edc:mask="0x1" edc:name="INT2PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS5" edc:mask="0x1" edc:name="INT2PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT2PPS" edc:mask="0x3f" edc:name="INT2PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T0CKIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T0CKIPPS" edc:nzwidth="8" edc:por="--000100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x241">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T0CKIPPS" edc:mask="0x3f" edc:name="T0CKIPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0CKIPPS0" edc:mask="0x1" edc:name="T0CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS1" edc:mask="0x1" edc:name="T0CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS2" edc:mask="0x1" edc:name="T0CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS3" edc:mask="0x1" edc:name="T0CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS4" edc:mask="0x1" edc:name="T0CKIPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS5" edc:mask="0x1" edc:name="T0CKIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T1CKIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T1CKIPPS" edc:nzwidth="8" edc:por="--010000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x242">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1CKIPPS0" edc:mask="0x1" edc:name="T1CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS1" edc:mask="0x1" edc:name="T1CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS2" edc:mask="0x1" edc:name="T1CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS3" edc:mask="0x1" edc:name="T1CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS4" edc:mask="0x1" edc:name="T1CKIPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS5" edc:mask="0x1" edc:name="T1CKIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T1CKIPPS" edc:mask="0x3f" edc:name="T1CKIPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
