garyPenhook/PIC-Assembler/edc/PIC18F55Q24.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="SPI1SSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="SPI1SSPPS" edc:nzwidth="8" edc:por="--000101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x26C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI1SSPPS0" edc:mask="0x1" edc:name="SPI1SSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS1" edc:mask="0x1" edc:name="SPI1SSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS2" edc:mask="0x1" edc:name="SPI1SSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS3" edc:mask="0x1" edc:name="SPI1SSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS4" edc:mask="0x1" edc:name="SPI1SSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS5" edc:mask="0x1" edc:name="SPI1SSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI1SSPPS" edc:mask="0x3f" edc:name="SPI1SSPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="SPI2SCKPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="SPI2SCKPPS" edc:nzwidth="8" edc:por="--001001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x26D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS0" edc:mask="0x1" edc:name="SPI2SCKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS1" edc:mask="0x1" edc:name="SPI2SCKPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS2" edc:mask="0x1" edc:name="SPI2SCKPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS3" edc:mask="0x1" edc:name="SPI2SCKPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS4" edc:mask="0x1" edc:name="SPI2SCKPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS5" edc:mask="0x1" edc:name="SPI2SCKPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS" edc:mask="0x3f" edc:name="SPI2SCKPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="SPI2SDIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="SPI2SDIPPS" edc:nzwidth="8" edc:por="--001010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x26E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS0" edc:mask="0x1" edc:name="SPI2SDIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS1" edc:mask="0x1" edc:name="SPI2SDIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS2" edc:mask="0x1" edc:name="SPI2SDIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS3" edc:mask="0x1" edc:name="SPI2SDIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS4" edc:mask="0x1" edc:name="SPI2SDIPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS5" edc:mask="0x1" edc:name="SPI2SDIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS" edc:mask="0x3f" edc:name="SPI2SDIPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="SPI2SSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="SPI2SSPPS" edc:nzwidth="8" edc:por="--001000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x26F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI2SSPPS0" edc:mask="0x1" edc:name="SPI2SSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SSPPS1" edc:mask="0x1" edc:name="SPI2SSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SSPPS2" edc:mask="0x1" edc:name="SPI2SSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SSPPS3" edc:mask="0x1" edc:name="SPI2SSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SSPPS4" edc:mask="0x1" edc:name="SPI2SSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SSPPS5" edc:mask="0x1" edc:name="SPI2SSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI2SSPPS" edc:mask="0x3f" edc:name="SPI2SSPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="I2C1SDAPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="I2C1SDAPPS" edc:nzwidth="8" edc:por="--010100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x270">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS0" edc:mask="0x1" edc:name="I2C1SDAPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS1" edc:mask="0x1" edc:name="I2C1SDAPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS2" edc:mask="0x1" edc:name="I2C1SDAPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS3" edc:mask="0x1" edc:name="I2C1SDAPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS4" edc:mask="0x1" edc:name="I2C1SDAPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS5" edc:mask="0x1" edc:name="I2C1SDAPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS" edc:mask="0x3f" edc:name="I2C1SDAPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="I2C1SCLPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="I2C1SCLPPS" edc:nzwidth="8" edc:por="--010011" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x271">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS0" edc:mask="0x1" edc:name="I2C1SCLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS1" edc:mask="0x1" edc:name="I2C1SCLPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS2" edc:mask="0x1" edc:name="I2C1SCLPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS3" edc:mask="0x1" edc:name="I2C1SCLPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS4" edc:mask="0x1" edc:name="I2C1SCLPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS5" edc:mask="0x1" edc:name="I2C1SCLPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS" edc:mask="0x3f" edc:name="I2C1SCLPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U1RXPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U1RXPPS" edc:nzwidth="8" edc:por="--010101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x272">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1RXPPS" edc:mask="0x3f" edc:name="U1RXPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U1RXPPS0" edc:mask="0x1" edc:name="U1RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS1" edc:mask="0x1" edc:name="U1RXPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS2" edc:mask="0x1" edc:name="U1RXPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS3" edc:mask="0x1" edc:name="U1RXPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS4" edc:mask="0x1" edc:name="U1RXPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS5" edc:mask="0x1" edc:name="U1RXPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
