garyPenhook/PIC-Assembler/edc/PIC18F55Q24.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TUIN1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="TUIN1PPS" edc:nzwidth="8" edc:por="--001101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x279">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUIN1PPS" edc:mask="0x3f" edc:name="TUIN1PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TUIN1PPS0" edc:mask="0x1" edc:name="TUIN1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN1PPS1" edc:mask="0x1" edc:name="TUIN1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN1PPS2" edc:mask="0x1" edc:name="TUIN1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN1PPS3" edc:mask="0x1" edc:name="TUIN1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN1PPS4" edc:mask="0x1" edc:name="TUIN1PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN1PPS5" edc:mask="0x1" edc:name="TUIN1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x27A"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PORTWIN0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PORTWIN0PPS" edc:nzwidth="8" edc:por="--001010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x27D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PORTWIN0PPS" edc:mask="0x3f" edc:name="PORTWIN0PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PORTWIN0PPS0" edc:mask="0x1" edc:name="PORTWIN0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWIN0PPS1" edc:mask="0x1" edc:name="PORTWIN0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWIN0PPS2" edc:mask="0x1" edc:name="PORTWIN0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWIN0PPS3" edc:mask="0x1" edc:name="PORTWIN0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWIN0PPS4" edc:mask="0x1" edc:name="PORTWIN0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWIN0PPS5" edc:mask="0x1" edc:name="PORTWIN0PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PORTWIN1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PORTWIN1PPS" edc:nzwidth="8" edc:por="--001000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x27E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PORTWIN1PPS" edc:mask="0x3f" edc:name="PORTWIN1PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PORTWIN1PPS0" edc:mask="0x1" edc:name="PORTWIN1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWIN1PPS1" edc:mask="0x1" edc:name="PORTWIN1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWIN1PPS2" edc:mask="0x1" edc:name="PORTWIN1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWIN1PPS3" edc:mask="0x1" edc:name="PORTWIN1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWIN1PPS4" edc:mask="0x1" edc:name="PORTWIN1PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWIN1PPS5" edc:mask="0x1" edc:name="PORTWIN1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PORTWCLKPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PORTWCLKPPS" edc:nzwidth="8" edc:por="--001001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x27F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PORTWCLKPPS" edc:mask="0x3f" edc:name="PORTWCLKPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PORTWCLKPPS0" edc:mask="0x1" edc:name="PORTWCLKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWCLKPPS1" edc:mask="0x1" edc:name="PORTWCLKPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWCLKPPS2" edc:mask="0x1" edc:name="PORTWCLKPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWCLKPPS3" edc:mask="0x1" edc:name="PORTWCLKPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWCLKPPS4" edc:mask="0x1" edc:name="PORTWCLKPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PORTWCLKPPS5" edc:mask="0x1" edc:name="PORTWCLKPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x280"/>
        <edc:SFRDef edc:access="nn----nn" edc:cname="RD0I2C" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="RD0I2C" edc:nzwidth="8" edc:por="00----00" edc:_addr="0x282">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
