garyPenhook/PIC-Assembler/edc/PIC18F55Q24.PIC
        <edc:SFRDef edc:access="nn----nn" edc:cname="RD1I2C" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="RD1I2C" edc:nzwidth="8" edc:por="00----00" edc:_addr="0x283">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="RC3I2C" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="RC3I2C" edc:nzwidth="8" edc:por="00----00" edc:_addr="0x284">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="RC4I2C" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="RC4I2C" edc:nzwidth="8" edc:por="00----00" edc:_addr="0x285">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="RB1I2C" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="RB1I2C" edc:nzwidth="8" edc:por="0000--00" edc:_addr="0x286">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU" edc:mask="0x3" edc:name="PU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU0" edc:mask="0x1" edc:name="PU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PU1" edc:mask="0x1" edc:name="PU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU" edc:mask="0x3" edc:name="I2CPU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU0" edc:mask="0x1" edc:name="I2CPU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CPU1" edc:mask="0x1" edc:name="I2CPU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
