garyPenhook/PIC-Assembler/edc/PIC18F55Q24.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C2ADR0" edc:desc="I2C ADDRESS REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="I2C2ADR0" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2A5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0xff" edc:name="ADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="I2C2ADR1" edc:desc="I2C ADDRESS REGISTER 1" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111110" edc:name="I2C2ADR1" edc:nzwidth="8" edc:por="11111110" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2A6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0x7f" edc:name="ADR" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C2ADR2" edc:desc="I2C ADDRESS REGISTER 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="I2C2ADR2" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2A7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0xff" edc:name="ADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="I2C2ADR3" edc:desc="I2C ADDRESS REGISTER 3" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111-" edc:name="I2C2ADR3" edc:nzwidth="8" edc:por="1111111-" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2A8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0x7f" edc:name="ADR" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnscrnnn" edc:cname="I2C2CON0" edc:desc="I2C CONTROL REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C2CON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2A9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:mask="0x7" edc:name="MODE" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="MDR" edc:mask="0x1" edc:name="MDR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSTR" edc:mask="0x1" edc:name="CSTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S" edc:mask="0x1" edc:name="S" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEN" edc:mask="0x1" edc:name="RSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="I2CEN" edc:mask="0x1" edc:name="I2CEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrsnnn" edc:cname="I2C2CON1" edc:desc="I2C CONTROL REGISTER 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C2CON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2AA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSD" edc:mask="0x1" edc:name="CSD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXU" edc:mask="0x1" edc:name="TXU" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXO" edc:mask="0x1" edc:name="RXO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P" edc:mask="0x1" edc:name="P" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKT" edc:mask="0x1" edc:name="ACKT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKSTAT" edc:mask="0x1" edc:name="ACKSTAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKDT" edc:mask="0x1" edc:name="ACKDT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKCNT" edc:mask="0x1" edc:name="ACKCNT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="I2C2CON2" edc:desc="I2C CONTROL REGISTER 2" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="I2C2CON2" edc:nzwidth="8" edc:por="00-00000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2AB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BFRET" edc:mask="0x3" edc:name="BFRET" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SDAHT" edc:mask="0x3" edc:name="SDAHT" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ABD" edc:mask="0x1" edc:name="ABD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GCEN" edc:mask="0x1" edc:name="GCEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACNT" edc:mask="0x1" edc:name="ACNT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BFRET0" edc:mask="0x1" edc:name="BFRET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BFRET1" edc:mask="0x1" edc:name="BFRET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SDAHT0" edc:mask="0x1" edc:name="SDAHT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SDAHT1" edc:mask="0x1" edc:name="SDAHT1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I2C2CON3" edc:desc="I2C CONTROL REGISTER 3" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="I2C2CON3" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ACNTMD" edc:mask="0x3" edc:name="ACNTMD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FME" edc:mask="0x3" edc:name="FME" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ACNTMD0" edc:mask="0x1" edc:name="ACNTMD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACNTMD1" edc:mask="0x1" edc:name="ACNTMD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FME0" edc:mask="0x1" edc:name="FME0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FME1" edc:mask="0x1" edc:name="FME1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="I2C2ERR" edc:desc="I2C ERROR REGISTER" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C2ERR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2AD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NACKIE" edc:mask="0x1" edc:name="NACKIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCLIE" edc:mask="0x1" edc:name="BCLIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOIE" edc:mask="0x1" edc:name="BTOIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="NACKIF" edc:mask="0x1" edc:name="NACKIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCLIF" edc:mask="0x1" edc:name="BCLIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOIF" edc:mask="0x1" edc:name="BTOIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NACK2IE" edc:mask="0x1" edc:name="NACK2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCL2IE" edc:mask="0x1" edc:name="BCL2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTO2IE" edc:mask="0x1" edc:name="BTO2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="NACK2IF" edc:mask="0x1" edc:name="NACK2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCL2IF" edc:mask="0x1" edc:name="BCL2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTO2IF" edc:mask="0x1" edc:name="BTO2IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
