garyPenhook/PIC-Assembler/edc/PIC18F55Q24.PIC
        <edc:AdjustPoint edc:offset="0x24" edc:_addr="0x2DC"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x3" edc:beginaddr="0x0300" edc:endaddr="0x0400" edc:regionid="sfr3">
        <edc:AdjustPoint edc:offset="0x12" edc:_addr="0x300"/>
        <edc:JoinedSFRDef edc:cname="TMR1" edc:desc="Joined 16-bit Timer" edc:name="TMR1" edc:nzwidth="0x10" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x312"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x312">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1L" edc:mask="0xff" edc:name="TMR1L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR1L0" edc:mask="0x1" edc:name="TMR1L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L1" edc:mask="0x1" edc:name="TMR1L1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L2" edc:mask="0x1" edc:name="TMR1L2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L3" edc:mask="0x1" edc:name="TMR1L3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L4" edc:mask="0x1" edc:name="TMR1L4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L5" edc:mask="0x1" edc:name="TMR1L5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L6" edc:mask="0x1" edc:name="TMR1L6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L7" edc:mask="0x1" edc:name="TMR1L7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR10" edc:mask="0x1" edc:name="TMR10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR11" edc:mask="0x1" edc:name="TMR11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR12" edc:mask="0x1" edc:name="TMR12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR13" edc:mask="0x1" edc:name="TMR13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR14" edc:mask="0x1" edc:name="TMR14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR15" edc:mask="0x1" edc:name="TMR15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR16" edc:mask="0x1" edc:name="TMR16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR17" edc:mask="0x1" edc:name="TMR17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR1H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x313">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1H" edc:mask="0xff" edc:name="TMR1H" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR1H0" edc:mask="0x1" edc:name="TMR1H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H1" edc:mask="0x1" edc:name="TMR1H1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H2" edc:mask="0x1" edc:name="TMR1H2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H3" edc:mask="0x1" edc:name="TMR1H3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H4" edc:mask="0x1" edc:name="TMR1H4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H5" edc:mask="0x1" edc:name="TMR1H5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H6" edc:mask="0x1" edc:name="TMR1H6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H7" edc:mask="0x1" edc:name="TMR1H7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR18" edc:mask="0x1" edc:name="TMR18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR19" edc:mask="0x1" edc:name="TMR19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR110" edc:mask="0x1" edc:name="TMR110" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR111" edc:mask="0x1" edc:name="TMR111" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR112" edc:mask="0x1" edc:name="TMR112" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR113" edc:mask="0x1" edc:name="TMR113" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR114" edc:mask="0x1" edc:name="TMR114" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR115" edc:mask="0x1" edc:name="TMR115" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="T1CON" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uu-u0u" edc:name="T1CON" edc:nzwidth="8" edc:por="--00-000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x314">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR1CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD16" edc:desc="" edc:mask="0x1" edc:name="RD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOT_SYNC" edc:desc="" edc:mask="0x1" edc:name="NOT_SYNC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x3" edc:name="CKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR1ON" edc:mask="0x1" edc:name="TMR1ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1RD16" edc:mask="0x1" edc:name="T1RD16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOT_T1SYNC" edc:mask="0x1" edc:name="NOT_T1SYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKPS0" edc:desc="" edc:mask="0x1" edc:name="T1CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKPS1" edc:desc="" edc:mask="0x1" edc:name="T1CKPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nSYNC" edc:mask="0x1" edc:name="nSYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RD161" edc:desc="" edc:mask="0x1" edc:name="RD161" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nT1SYNC" edc:mask="0x1" edc:name="nT1SYNC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
