garyPenhook/PIC-Assembler/edc/PIC18F55Q24.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BCON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BCON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3AB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CIE" edc:desc="" edc:mask="0x1" edc:name="CIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ZIE" edc:desc="" edc:mask="0x1" edc:name="ZIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PRIE" edc:desc="" edc:mask="0x1" edc:name="PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDSEL" edc:desc="" edc:mask="0x1" edc:name="RDSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPOL" edc:desc="" edc:mask="0x1" edc:name="OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OM" edc:desc="" edc:mask="0x1" edc:name="OM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TU16BCIE" edc:desc="" edc:mask="0x1" edc:name="TU16BCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16BZIE" edc:desc="" edc:mask="0x1" edc:name="TU16BZIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16BPRIE" edc:mask="0x1" edc:name="TU16BPRIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BRDSEL" edc:desc="" edc:mask="0x1" edc:name="TU16BRDSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16BOPOL" edc:mask="0x1" edc:name="TU16BOPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BOM" edc:mask="0x1" edc:name="TU16BOM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCPOL" edc:mask="0x1" edc:name="TU16BCPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BON" edc:mask="0x1" edc:name="TU16BON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnnnnn" edc:cname="TU16BCON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BCON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3AC">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CIF" edc:desc="" edc:mask="0x1" edc:name="CIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZIF" edc:desc="" edc:mask="0x1" edc:name="ZIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PRIF" edc:desc="" edc:mask="0x1" edc:name="PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAPT" edc:desc="" edc:mask="0x1" edc:name="CAPT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LIMIT" edc:mask="0x1" edc:name="LIMIT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLR" edc:desc="" edc:mask="0x1" edc:name="CLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSEN" edc:desc="" edc:mask="0x1" edc:name="OSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RUN" edc:desc="" edc:mask="0x1" edc:name="RUN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TU16BCIF" edc:mask="0x1" edc:name="TU16BCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BZIF" edc:mask="0x1" edc:name="TU16BZIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPRIF" edc:mask="0x1" edc:name="TU16BPRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCAPT" edc:mask="0x1" edc:name="TU16BCAPT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BLIMIT" edc:mask="0x1" edc:name="TU16BLIMIT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLR" edc:desc="" edc:mask="0x1" edc:name="TU16BCLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMRBOSEN" edc:desc="" edc:mask="0x1" edc:name="TMRBOSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16BRUN" edc:desc="" edc:mask="0x1" edc:name="TU16BRUN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BHLT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BHLT" edc:nzwidth="8" edc:por="01000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3AD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STOP" edc:mask="0x3" edc:name="STOP" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="RESET" edc:mask="0x3" edc:name="RESET" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="START" edc:mask="0x3" edc:name="START" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CSYNC" edc:mask="0x1" edc:name="CSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOL" edc:mask="0x1" edc:name="EPOL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="STOP0" edc:mask="0x1" edc:name="STOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STOP1" edc:mask="0x1" edc:name="STOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESET0" edc:mask="0x1" edc:name="RESET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESET1" edc:mask="0x1" edc:name="RESET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="START0" edc:mask="0x1" edc:name="START0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="START1" edc:mask="0x1" edc:name="START1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16BSTOP" edc:mask="0x3" edc:name="TU16BSTOP" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TU16BRESET" edc:mask="0x3" edc:name="TU16BRESET" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TU16BSTART" edc:mask="0x3" edc:name="TU16BSTART" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TU16BCSYNC" edc:mask="0x1" edc:name="TU16BCSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BEPOL" edc:mask="0x1" edc:name="TU16BEPOL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TU16BSTOP0" edc:mask="0x1" edc:name="TU16BSTOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BSTOP1" edc:mask="0x1" edc:name="TU16BSTOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BRESET0" edc:mask="0x1" edc:name="TU16BRESET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BRESET1" edc:mask="0x1" edc:name="TU16BRESET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BSTART0" edc:mask="0x1" edc:name="TU16BSTART0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BSTART1" edc:mask="0x1" edc:name="TU16BSTART1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BPS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BPS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3AE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PS" edc:mask="0xff" edc:name="PS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PS0" edc:mask="0x1" edc:name="PS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:mask="0x1" edc:name="PS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:mask="0x1" edc:name="PS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS3" edc:mask="0x1" edc:name="PS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS4" edc:mask="0x1" edc:name="PS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS5" edc:mask="0x1" edc:name="PS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS6" edc:mask="0x1" edc:name="PS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS7" edc:mask="0x1" edc:name="PS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16BPS0" edc:mask="0x1" edc:name="TU16BPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS1" edc:mask="0x1" edc:name="TU16BPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS2" edc:mask="0x1" edc:name="TU16BPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS3" edc:mask="0x1" edc:name="TU16BPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS4" edc:mask="0x1" edc:name="TU16BPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS5" edc:mask="0x1" edc:name="TU16BPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS6" edc:mask="0x1" edc:name="TU16BPS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS7" edc:mask="0x1" edc:name="TU16BPS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TU16BPS" edc:mask="0xff" edc:name="TU16BPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
