garyPenhook/PIC-Assembler/edc/PIC18F55Q24.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TU16BERS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="TU16BERS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3B8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERS" edc:mask="0x3f" edc:name="ERS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ERS0" edc:mask="0x1" edc:name="ERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS1" edc:mask="0x1" edc:name="ERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS2" edc:mask="0x1" edc:name="ERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS3" edc:mask="0x1" edc:name="ERS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS4" edc:mask="0x1" edc:name="ERS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS5" edc:mask="0x1" edc:name="ERS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16BERS0" edc:mask="0x1" edc:name="TU16BERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS1" edc:mask="0x1" edc:name="TU16BERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS2" edc:mask="0x1" edc:name="TU16BERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS3" edc:mask="0x1" edc:name="TU16BERS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS4" edc:mask="0x1" edc:name="TU16BERS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS5" edc:mask="0x1" edc:name="TU16BERS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="TUCHAIN" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------u" edc:name="TUCHAIN" edc:nzwidth="8" edc:por="-------x" edc:_addr="0x3B9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CH16AB" edc:mask="0x1" edc:name="CH16AB" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x3BA"/>
        <edc:SFRDef edc:access="-------n" edc:cname="CWG1CLK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="CWG1CLK" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3BC">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG1CLKCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x1" edc:name="CS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1CS" edc:mask="0x1" edc:name="CWG1CS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CWG1ISM" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="CWG1ISM" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3BD">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG1DAT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ISM" edc:mask="0x1f" edc:name="ISM" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1ISM" edc:mask="0x1f" edc:name="CWG1ISM" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ISM0" edc:mask="0x1" edc:name="ISM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM1" edc:mask="0x1" edc:name="ISM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM2" edc:mask="0x1" edc:name="ISM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM3" edc:mask="0x1" edc:name="ISM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM4" edc:mask="0x1" edc:name="ISM4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CWG1DBR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3BE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBR" edc:desc="" edc:mask="0x3f" edc:name="DBR" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DBR0" edc:desc="" edc:mask="0x1" edc:name="DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR1" edc:desc="" edc:mask="0x1" edc:name="DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR2" edc:desc="" edc:mask="0x1" edc:name="DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR3" edc:desc="" edc:mask="0x1" edc:name="DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR4" edc:desc="" edc:mask="0x1" edc:name="DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR5" edc:desc="" edc:mask="0x1" edc:name="DBR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1DBR" edc:mask="0x3f" edc:name="CWG1DBR" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1DBR0" edc:mask="0x1" edc:name="CWG1DBR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR1" edc:mask="0x1" edc:name="CWG1DBR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR2" edc:mask="0x1" edc:name="CWG1DBR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR3" edc:mask="0x1" edc:name="CWG1DBR3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR4" edc:mask="0x1" edc:name="CWG1DBR4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR5" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CWG1DBF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3BF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBF" edc:desc="" edc:mask="0x3f" edc:name="DBF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DBF0" edc:desc="" edc:mask="0x1" edc:name="DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF1" edc:desc="" edc:mask="0x1" edc:name="DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF2" edc:desc="" edc:mask="0x1" edc:name="DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF3" edc:desc="" edc:mask="0x1" edc:name="DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF4" edc:desc="" edc:mask="0x1" edc:name="DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF5" edc:desc="" edc:mask="0x1" edc:name="DBF5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1DBF" edc:desc="" edc:mask="0x3f" edc:name="CWG1DBF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1DBF0" edc:mask="0x1" edc:name="CWG1DBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF1" edc:mask="0x1" edc:name="CWG1DBF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF2" edc:mask="0x1" edc:name="CWG1DBF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF3" edc:mask="0x1" edc:name="CWG1DBF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF4" edc:mask="0x1" edc:name="CWG1DBF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF5" edc:mask="0x1" edc:name="CWG1DBF5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---nnn" edc:cname="CWG1CON0" edc:desc="" edc:impl="0xc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---000" edc:name="CWG1CON0" edc:nzwidth="8" edc:por="00---000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LD" edc:desc="" edc:mask="0x1" edc:name="LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G1EN" edc:mask="0x1" edc:name="G1EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1MODE" edc:mask="0x7" edc:name="CWG1MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="CWG1LD" edc:mask="0x1" edc:name="CWG1LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1EN" edc:mask="0x1" edc:name="CWG1EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1MODE0" edc:mask="0x1" edc:name="CWG1MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1MODE1" edc:mask="0x1" edc:name="CWG1MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1MODE2" edc:mask="0x1" edc:name="CWG1MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--r-nnnn" edc:cname="CWG1CON1" edc:desc="" edc:impl="0x2f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--x-0000" edc:name="CWG1CON1" edc:nzwidth="0x8" edc:por="--x-0000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POLA" edc:desc="" edc:mask="0x1" edc:name="POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLB" edc:desc="" edc:mask="0x1" edc:name="POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLC" edc:desc="" edc:mask="0x1" edc:name="POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLD" edc:desc="" edc:mask="0x1" edc:name="POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IN" edc:desc="" edc:mask="0x1" edc:name="IN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1POLA" edc:mask="0x1" edc:name="CWG1POLA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1POLB" edc:mask="0x1" edc:name="CWG1POLB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1POLC" edc:mask="0x1" edc:name="CWG1POLC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1POLD" edc:desc="" edc:mask="0x1" edc:name="CWG1POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1IN" edc:mask="0x1" edc:name="CWG1IN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="CWG1AS0" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000101--" edc:name="CWG1AS0" edc:nzwidth="8" edc:por="000101--" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LSAC" edc:desc="" edc:mask="0x3" edc:name="LSAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="LSDBD" edc:desc="" edc:mask="0x3" edc:name="LSDBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="REN" edc:desc="" edc:mask="0x1" edc:name="REN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SHUTDOWN" edc:desc="" edc:mask="0x1" edc:name="SHUTDOWN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LSAC0" edc:desc="" edc:mask="0x1" edc:name="LSAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSCA1" edc:desc="" edc:mask="0x1" edc:name="LSCA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSDB0" edc:desc="" edc:mask="0x1" edc:name="LSDB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSDB1" edc:desc="" edc:mask="0x1" edc:name="LSDB1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="CWG1LSAC0" edc:mask="0x1" edc:name="CWG1LSAC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1LSAC1" edc:mask="0x1" edc:name="CWG1LSAC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1LSDB0" edc:mask="0x1" edc:name="CWG1LSDB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1LSDB1" edc:mask="0x1" edc:name="CWG1LSDB1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CWG1LSAC" edc:mask="0x3" edc:name="CWG1LSAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CWG1LSDB" edc:mask="0x3" edc:name="CWG1LSDB" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="LSBD" edc:desc="" edc:mask="0x3" edc:name="LSBD" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LSAC1" edc:desc="" edc:mask="0x1" edc:name="LSAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSBD0" edc:desc="" edc:mask="0x1" edc:name="LSBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSBD1" edc:desc="" edc:mask="0x1" edc:name="LSBD1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CWG1LSBD0" edc:mask="0x1" edc:name="CWG1LSBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1LSBD1" edc:mask="0x1" edc:name="CWG1LSBD1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.6">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CWG1LSBD" edc:mask="0x3" edc:name="CWG1LSBD" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="CWG1AS1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="CWG1AS1" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AS0E" edc:desc="" edc:mask="0x1" edc:name="AS0E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS1E" edc:desc="" edc:mask="0x1" edc:name="AS1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS2E" edc:desc="" edc:mask="0x1" edc:name="AS2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS3E" edc:desc="" edc:mask="0x1" edc:name="AS3E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS4E" edc:mask="0x1" edc:name="AS4E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS5E" edc:mask="0x1" edc:name="AS5E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS6E" edc:mask="0x1" edc:name="AS6E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS7E" edc:mask="0x1" edc:name="AS7E" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
