garyPenhook/PIC-Assembler/edc/PIC18F55Q24.PIC
        <edc:SFRDef edc:access="rrrc-rrr" edc:cname="ADSTAT" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="ADSTAT" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STAT" edc:desc="" edc:mask="0x7" edc:name="STAT" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MATH" edc:desc="" edc:mask="0x1" edc:name="MATH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LTHR" edc:desc="" edc:mask="0x1" edc:name="LTHR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UTHR" edc:desc="" edc:mask="0x1" edc:name="UTHR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AOV" edc:desc="" edc:mask="0x1" edc:name="AOV" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADSTAT0" edc:desc="" edc:mask="0x1" edc:name="ADSTAT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADSTAT1" edc:desc="" edc:mask="0x1" edc:name="ADSTAT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADSTAT2" edc:desc="" edc:mask="0x1" edc:name="ADSTAT2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADMATH" edc:mask="0x1" edc:name="ADMATH" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADLTHR" edc:mask="0x1" edc:name="ADLTHR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADUTHR" edc:mask="0x1" edc:name="ADUTHR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADAOV" edc:mask="0x1" edc:name="ADAOV" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADSTAT" edc:mask="0x7" edc:name="ADSTAT" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ADOV" edc:mask="0x1" edc:name="ADOV" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="STAT0" edc:mask="0x1" edc:name="STAT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STAT1" edc:mask="0x1" edc:name="STAT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STAT2" edc:mask="0x1" edc:name="STAT2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="OV" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n--nn" edc:cname="ADREF" edc:desc="" edc:impl="0x13" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0--00" edc:name="ADREF" edc:nzwidth="8" edc:por="---0--00" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PREF" edc:mask="0x3" edc:name="PREF" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="NREF" edc:mask="0x1" edc:name="NREF" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPREF" edc:mask="0x3" edc:name="ADPREF" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="ADNREF" edc:mask="0x1" edc:name="ADNREF" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PREF0" edc:mask="0x1" edc:name="PREF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PREF1" edc:mask="0x1" edc:name="PREF1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="NREF0" edc:mask="0x1" edc:name="NREF0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="ADPREF0" edc:mask="0x1" edc:name="ADPREF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADPREF1" edc:mask="0x1" edc:name="ADPREF1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADNREF0" edc:mask="0x1" edc:name="ADNREF0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADACT" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADACT" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ACT" edc:desc="" edc:mask="0x3f" edc:name="ACT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADACT0" edc:desc="" edc:mask="0x1" edc:name="ADACT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT1" edc:desc="" edc:mask="0x1" edc:name="ADACT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT2" edc:desc="" edc:mask="0x1" edc:name="ADACT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT3" edc:desc="" edc:mask="0x1" edc:name="ADACT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT4" edc:desc="" edc:mask="0x1" edc:name="ADACT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT5" edc:desc="" edc:mask="0x1" edc:name="ADACT5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADACT" edc:mask="0x3f" edc:name="ADACT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="ACT0" edc:mask="0x1" edc:name="ACT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT1" edc:mask="0x1" edc:name="ACT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT2" edc:mask="0x1" edc:name="ACT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT3" edc:mask="0x1" edc:name="ACT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT4" edc:mask="0x1" edc:name="ACT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT5" edc:mask="0x1" edc:name="ACT5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADCLK" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADCLK" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3FA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3f" edc:name="CS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCS0" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS3" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS4" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS5" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADCS" edc:mask="0x3f" edc:name="ADCS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS4" edc:mask="0x1" edc:name="CS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS5" edc:mask="0x1" edc:name="CS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x5" edc:_addr="0x3FB"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x4" edc:beginaddr="0x0400" edc:endaddr="0x0460" edc:regionid="sfr4">
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELA" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x400">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELA0" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA1" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA2" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA3" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA4" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA5" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA6" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA7" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
