garyPenhook/PIC-Assembler/edc/PIC18F55Q24.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCDP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCDP" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCDP0" edc:mask="0x1" edc:name="IOCDP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDP1" edc:mask="0x1" edc:name="IOCDP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDP2" edc:mask="0x1" edc:name="IOCDP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDP3" edc:mask="0x1" edc:name="IOCDP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDP4" edc:mask="0x1" edc:name="IOCDP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDP5" edc:mask="0x1" edc:name="IOCDP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDP6" edc:mask="0x1" edc:name="IOCDP6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDP7" edc:mask="0x1" edc:name="IOCDP7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCDN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCDN" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCDN0" edc:mask="0x1" edc:name="IOCDN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDN1" edc:mask="0x1" edc:name="IOCDN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDN2" edc:mask="0x1" edc:name="IOCDN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDN3" edc:mask="0x1" edc:name="IOCDN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDN4" edc:mask="0x1" edc:name="IOCDN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDN5" edc:mask="0x1" edc:name="IOCDN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDN6" edc:mask="0x1" edc:name="IOCDN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDN7" edc:mask="0x1" edc:name="IOCDN0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCDF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCDF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCDF0" edc:mask="0x1" edc:name="IOCDF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDF1" edc:mask="0x1" edc:name="IOCDF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDF2" edc:mask="0x1" edc:name="IOCDF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDF3" edc:mask="0x1" edc:name="IOCDF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDF4" edc:mask="0x1" edc:name="IOCDF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDF5" edc:mask="0x1" edc:name="IOCDF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDF6" edc:mask="0x1" edc:name="IOCDF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCDF7" edc:mask="0x1" edc:name="IOCDF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ANSELE" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="ANSELE" edc:nzwidth="8" edc:por="-----111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x420">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELE0" edc:mask="0x1" edc:name="ANSELE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELE1" edc:mask="0x1" edc:name="ANSELE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELE2" edc:mask="0x1" edc:name="ANSELE0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="WPUE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="WPUE" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x421">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUE0" edc:mask="0x1" edc:name="WPUE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUE1" edc:mask="0x1" edc:name="WPUE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUE2" edc:mask="0x1" edc:name="WPUE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUE3" edc:mask="0x1" edc:name="WPUE0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ODCONE" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="ODCONE" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x422">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCE0" edc:mask="0x1" edc:name="ODCE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCE1" edc:mask="0x1" edc:name="ODCE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCE2" edc:mask="0x1" edc:name="ODCE0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="SLRCONE" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="SLRCONE" edc:nzwidth="8" edc:por="-----111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x423">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRE0" edc:mask="0x1" edc:name="SLRE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRE1" edc:mask="0x1" edc:name="SLRE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRE2" edc:mask="0x1" edc:name="SLRE0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="INLVLE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1111" edc:name="INLVLE" edc:nzwidth="8" edc:por="----1111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x424">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLE0" edc:mask="0x1" edc:name="INLVLE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLE1" edc:mask="0x1" edc:name="INLVLE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLE2" edc:mask="0x1" edc:name="INLVLE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLE3" edc:mask="0x1" edc:name="INLVLE0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEP" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEP" edc:nzwidth="8" edc:por="----0---" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x425">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCEP3" edc:mask="0x1" edc:name="IOCEP3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
